OpenFOAM-dev/tutorials/incompressibleFluid/drivaerFastback/system/decomposeParDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  8;

method              scotch;
//method              hierarchical;

hierarchicalCoeffs
{
    n               (4 2 1);
    order           xyz;
}

// ************************************************************************* //
